#include "input.h"
using namespace std;
map<char, int> translate{
    {'а', 15}, {'б', 19}, {'в', 31},
    {'г', 45}, {'ґ', 72}, {'д', 21},
    {'е', 39}, {'є',  97},{'ж', 74},
    {'з', 51}, {'и', 28}, {'і', 65},
    {'ї', 18}, {'й', 33}, {'к', 83},
    {'л', 85},{'м', 40}, {'н', 57}, 
    {'о', 43},  {'п', 77},  {'р', 88}, 
    {'с', 14}, {'т', 11}, {'у', 29}, 
    {'ф', 76}, {'х', 44}, {'ц', 22}, 
    {'ч', 41}, {'ш', 35}, {'щ', 67}, 
    {'ь', 56}, {'ю', 54}, {'я', 17}, 
    {'-', 79}, {'.', 84}, {',', 99},
    {'(', 58}, {')', 73}, {'?', 66},
    {'!', 34}, {'0', 25}, {'1', 92}, 
    {'2', 59}, {' ', 10}, };
void input(int limit, char chartext[], int inttext[],int openk,int P)
{
    cout << "Введіть текст так, що ліміт не перевищував " << limit << " символів (бажанно українські і без пробілів)\n";
    cin >> chartext;
    for (int i = 0;i < limit;i++)
        inttext[i] = translate[chartext[i]];
    cout << "Зашифрований текст:";
    for (int i = 0;i < limit;i++)
        inttext[i] = (inttext[i]^P)%openk;
    for (int i = 0;i < limit;i++)
        cout << inttext[i] << " ";
}